[
    {
      "title": "Mid 20's with no uni education, with 10+ experience in retail/food industry - mostly management, trying to get into other fields, Canada - neurodivergent",
      "body": "TLDR: How can I best format my resume to not include education? - also any other advice for how to break into another industry without university education would be appreciated, not looking for a career but a more entry level job until I can afford to upgrade and go to university.\n\n---\n\nHi, I'm currently working in retail and have just come back to work from medical leave for severe burnout from working full-time in a toxic environment.\n\n I'm now working in the same place in a different role at part time, but the hours are not enough to live on so I'm trying to find more work. My problem is that I don't just want to keep up this cycle of finding a minimum wage job that I have to overwork myself in just to pay the bills, but isn't good for my mental health. \n\nA lot of the people in my life have suggested some sort of data entry job or call center job until I'm able to save up to go back to school and do upgrading (so I can eventually go into a program at university), but until then I need to find a job that I can work hard in and will see the effort I put into my job- unfortunately all the retail/food industry jobs I've had have been very clique-y and unprofessional.\n\nI'm a very hard worker and I'm extremely intuitive and have great ideas, but unfortunately I have severe adhd and can't control how much I talk a lot of the time- which is why I'm in retail right now. I'm also asd and struggle with being a doormat when it comes to people in positions of power over me, so I end up getting treated really badly by my bosses. \n\nI just want a job where I can put my head down, work hard and not feel like I'm the weird kid in school again. \n\nAnyway, sorry for the rant.\n\nThanks for any advice. \n\n",
      "subreddit": "resumes",
      "created_utc": 1729098597
    },
    {
      "title": "Not sure how to feel.. please help! ",
      "body": "So just posting this here, because I don’t have anyone else to speak to.\n\nBut I think I’m experiencing burnout really badly, work has become to much pressure. Since my old manager left, I still don’t know if I’m doing things correctly I have a constant fear of being told off and found out to be an imposter… my new manager has just started but whilst he’s new there is just a few things I will need to support him with, he had perviously mentioned that some of the staff in other locations, have spoken very highly of me, and this made me instantly feel very anxious and want to run away and hide… I think I might hand my resignation in tomorrow because I just don’t feel like I can do this for much longer",
      "subreddit": "managers",
      "created_utc": 1729190284
    },
    {
      "title": "Leadership Feels Isolating. ",
      "body": "Hey everyone,\n\nI need to get this off my chest because leadership has become so isolating, and I’m struggling to carry the weight alone. When I first joined my company, it was a whirlwind. Within one week of my hire, there was a mass exodus of employees. Many of them were extremely loyal to the previous department manager, and I felt like I was stepping into a minefield right from the start.\n\nI lead a team of field technicians, and every day I’m in the trenches with them – providing guidance, troubleshooting issues, setting up trainings to sharpen their skills, and ensuring they have the tools they need to succeed. On top of that, I’ve spent countless hours developing strategies for the department, brainstorming marketing ideas, budgeting, hiring, firing, coaching, and mentoring.\n\nRecently, I hit my breaking point and had to sit down with the two owners. I told them I was burnt out and needed five days to unplug and recharge. They were supportive, but the sad truth is, I feel so distant from my team right now.\n\nNow, my team is calling me a liar because they think I’m holding back on raises for them. That breaks my heart. I’ve been fighting so hard behind the scenes to get them raises and the recognition they deserve. I’ve spent hours in meetings, making the case for their pay increases, doing everything I can to support them – but they don’t see that.\n\nIt hurts. I’ve poured everything I have into this role, and it feels like none of it matters to them. Being a leader can be incredibly lonely. No one tells you how isolating it can be, or how sometimes, even when you give everything you have, it still feels like you’re walking a road alone.",
      "subreddit": "Leadership",
      "created_utc": 1728989026
    },
    {
      "title": "I feel isolated and burnt out",
      "body": "I’m a president of a student led club at college. I’ve never taken such a big leadership role. I manage a team of 18 people and I used to have 2 VPs by my side. One of my VPs left the club after some personal stressors out of their control. The other vp is just incredibly passive and does not engage with the members of the club at all. Furthermore, other members are outshining the current vp by communicating important things that VPs are supposed to do.\n\nI feel like the key members of my club just use their roles to put on their resume. And, upon confrontation, I get hit back with “this is a volunteer role”, “you’re the president you have more responsibilities”, “you need to be more chill”, etc.\n\nI feel so isolated and burnt out and I’m getting no support.\n",
      "subreddit": "Leadership",
      "created_utc": 1727142869
    },
    {
      "title": "Extreme stress at work has caught up with me",
      "body": "Like the title says, I have been under extreme stress at work (long hours, including weekends and a lot of pressure) and it has caught up with me. My manager adjusted my workload recently but it’s still a lot and in some ways it is added responsibility. I have recently been spoken to about my communication, which in a couple of instances was harsh. I’m struggling with burnout and not handling stress well. Besides looking for another job, I’m looking for advice on how to survive this. ",
      "subreddit": "work",
      "created_utc": 1729080228
    },
    {
      "title": "Is it awful to resign after a company restructure that factored you in?",
      "body": "The obvious answer to the question is yes, but please hear me out.\n\nThe latest restructure at my company involves me taking on more clients, something I have gently but repeatedly said doesn't allow me to perform at the best of my ability. The last time I was over this many accounts, I hit burnout and was not very well. When they communicated the new structure I voiced my concerns, and these were heard but not taken on board. But then, of course, it's their company, they are allowed to do what they need to to make it run properly and grow.\n\nSince the restructure I've been handed the new clients with an immediate backlog of work, to help the boss \"clear their decks\". One week in and I'm already feeling very stressed, not sleeping well, my work is suffering and clients are beginning to notice. I'm trying to crack on and do my best, stay positive, manage time and priorities, but I can feel myself sinking mentally.\n\nI want to resign, but I feel alot of guilt around it. I've been told my role is VERY hard to hire for (they've been trying to recruit another for a year or so already) and I was factored into this new company structure that involves me on these accounts I have experience on. My direct line management is great and trying to help and support as best they can - but tbh I've mentally checked out. I'm in my 40s and want control back over my career, my workload and my successes.\n\nWhat is the best thing to do here? Thanks.",
      "subreddit": "work",
      "created_utc": 1729009710
    },
    {
      "title": "Learning the Hard Way About Burnout",
      "body": "A few years back, I thought I had everything figured out. I’d wake up at 5 AM, plan my day down to the minute, and try to squeeze as much as possible into every hour. I was so determined to make every moment count that I didn’t realize I was burning myself out.\n\nIt all came crashing down when I got sick for almost two weeks. My body just couldn’t keep up with the pace anymore. I had no choice but to slow down, and that’s when I realized I was doing it all wrong. Pushing myself nonstop wasn’t sustainable and definitely wasn’t effective in the long run.\n\nThese days, I still wake up early, but I focus on a few key tasks each day instead of filling every moment with something useful. It’s been a game-changer for my energy and motivation. How do you find balance?",
      "subreddit": "productivity",
      "created_utc": 1728636783
    },
    {
      "title": "Was transitioning to new position, but now I’m doing both and failing at both. What should I do now?",
      "body": "Transition to new position and falling behind.\n\nI’ve been with the same company for 12 yrs now. The last 2 years I’ve been struggling badly to keep up. The last year was a constant struggle to stay afloat. Working through my burn out probably damaged me more than I realized.\n\nIn any event, my discussion with upper management was to move to a new position that might provide me with more balance and control than my last position. However, since no one is available to take over my current role the discussion was for me to finish my current projects through June and slowly transition into my new role, starting with training for it this month. \n\nA few weeks ago our company landed the biggest project we’ve ever had. My boss thought it was a good idea I should be involved immediately under my new position/role. So I’ve been tasked with a massive project to start under this new position. I gravely underestimated the size and scope of the new project and my new role in it, and quite simple cannot manage to get it done, on top of the projects I’m currently managing in my old role. I have now completely missed my first deadline in the new position.\n\nBefore agreeing to the new position I said I wanted to be setup for success especially since my last couple of years I’ve been basically just trying to stay afloat and dig myself out of my hole. I said it would be nearly impossible to do both roles at the same time. Nevertheless, I’m doing both at the same time and now I’m failing at both. \n\nA lot of this is my fault because obviously I’m having a terrible time managing both and now missing deadlines for both. I’ve agree to try me new role as I was asked and agreed to the deadline. I missed the deadline. \n\nI don’t know what to do anymore. It’s to the point where should I just leave the company. I’m failing both areas now. Should I tell my boss I can’t take the new role. \n\nMy judgement is also clouded because I’m just so overwhelmed and the failure is eating me alive. This has consumed me for days and I just don’t know what to do.\n\nDoes anyone have advice on how I should approach this?",
      "subreddit": "careerquestions",
      "created_utc": 1704660683
    },
    {
      "title": "WWYD from healthcare to tech switch ",
      "body": "\nI am a healthcare administrator with 18+ years of experience. I am at an executive level making 190k+ a year but I am approaching burnout in my early 40s. The amount of daily shit that I have to eat from employees, physicians and other administrators is ungodly. Let alone observing the worst behaviors and greed of highly paid clinicians that behave like children and are never happy. Although you could say I am in a great spot (and don’t get me wrong, I’m grateful), it is mentally taxing and I am starting to turn bitter and not contain my anger, which is spilling into my personal life. I know it is just a job and I should not care, and so far I had done a great job compartmentalizing but my compartments are overflowing now. \n\nI am thinking that it would be great to switch careers, get into an IT/IS career where I could be highly specialized, with comparable compensation, individual contributor and be able to do remote work and contract work perhaps (I know, don’t we all!), perhaps have multiple remote gigs. I am not naive knowing that you have to eat shit at any job, no matter what. But at least if I am in a specialized technical position I can focus on doing my own thing, it’s on me to deliver.\n\nI am willing to take the classes, courses, certifications needed and do the work, I already have an engineering bachelors. For those that have first hand knowledge of the IT industry, what are some niches or areas that I should look into? Tech is such a broad spectrum, but recently cybersecurity has been popular and being pushed a lot, but is it really in high demand? It seems to me that it is overcrowded, or it will be soon. \n\nAny suggestions or career advice would be welcome. \n\nPS. I’m already going to therapy to address my current issues. I wrote this post for career advice, I appreciate it. ",
      "subreddit": "cscareers",
      "created_utc": 1729014771
    },
    {
      "title": "Lost my Mojo",
      "body": "I started programming 3 years ago by taking a web bootcamp. I lucked out with a great teacher and really enjoyed it. Learned JS/React\n\n\n\nNow fast forward to now I feel burned out. I don’t have that love I had at the start. I have to do more and more back end for the React Native app I’m working on and I’m not good at it. In fact I dread it.\n\n\n\nMy bane is config files. I can never tell if they are working or not. If you mistype one character it won’t work, but it won’t tell you, and you can’t know if the it’s the config or your code that isn’t working.\n\n\n\nTools like Postman are cool for api integration testing but with how complex modern auth flows and how cryptic cloud docs are, I just throw my hands up. Instead I just bumble through it some other way.\n\n\n\nI can manage with good docs, but there’s a lot of bad ones out there. I feel like there’s a mysterious set of insider knowledge that BE devs have that I don’t that would unlock this whole mysterious world for me.\n\n\n\nFE just 'clicked' for me. I can wrestle with CSS and React all day and go home feeling fulfilled. BE feels like I'm being bound and tortured.\n\n\n\nDo I just have a skill issue? How did BE click for you guys? Where should I start?\n\nTLDR: FE dev who has to do BE, what can I do?\n\nEdit: formatting",
      "subreddit": "cscareers",
      "created_utc": 1727363334
    },
    {
      "title": "Burnout - Work doesn't stress me, Coworkers and Bosses do",
      "body": "To keep it short, I ended up in a toxic work environment with a narcisstic boss that made my life a living hell. Wasn't able to leave the job, since my wife is sick and I am the only one with an income. So I held on to the job until I got sick.\n\nIn the past few months I came to the realisation, that work tasks don't burn me out. It's the coworkers, the bosses, the office etiquette and the afterwork stuff. I'm trying to find ways I can get back into a job, but nothing terrifies me more than the thought of having to deal with coworkers and bosses again.\n\nHas anyone else had this problem? How did you overcome it?",
      "subreddit": "burnedout",
      "created_utc": 1729165301
    },
    {
      "title": "Balancing Work, Dreams, and Burnout – Losing Motivation to Chase My Passion",
      "body": "I'm not sure if this is the right reddit for me or not.  Hope it is.\n\n\n\nI'm a full-time employee, and my job pays me well (all bills are paid, and food is on my table). I still don't have my own home (rental). And I'm not trying to complain about the workload, even though I would like to because it's too much to handle. However, I must admit I'm blessed for being employed.  \n\n\n\nI just started doing my master's (EMBA), first semester.  Assignments are kind of long but that's fine.  \n\n\n\nIn 2020, I found out that I love telling stories and making games (game development).  I even published a game on a well known website for PC games in 2021.  It didn't make me money, but I feel proud that I achieved that.\n\n\n\nI had so much hope that one day I would become a full-time game developer but with my full-time job, but lately I don't have that energy to work on anything once I'm home.  I work from 7:30 AM till 4:30 PM; very often till 6 PM.  And even when I get home I have things to do for work.  So, I cannot just leave my work back at the office, I take it home with me.\n\n\n\nNowadays, I'm always tired and down and I started questioning about my dream of being a full-time game developer.  Even my PC that I built for this purpose only, now being used for work.  I even started telling myself that eventually, we will all die, so why bother following such dreams? But I get more depressed when this part of my brain starts talking this way.\n\n\n\nI tried organizing my days but even when with that I ended up going home so tired after fighting at work and fell asleep on the coach.  \n\n\n\nIt's not that I don't have the time, it's that I don't have the energy to do anything.  I'm not even working out like I used to and it took it's toll on my weight.  I cannot lose weight not matter what.\n\n\n\nI was diagnosed with an emotionally unstable personality, borderline type.  But I'm unsure if this has something to do with my current emotional situation.\n\n\n\nEven while typing this reddit post, I feel overwhelmed because I've never been able to talk my head out.  \n\n\n\nThanks for reading.\n\n",
      "subreddit": "burnedout",
      "created_utc": 1729133795
    },
    {
      "title": "I never recovered from my burnout ",
      "body": "I never recovered from my burnout. I just don’t have the time. My life is always go, go, go and I feel like it’s catching up to me. I need like 3 months to a year to just exist and process life without a heavy load of responsibilities and stress. Not sure what the consequences will be or how it will manifest. Anyone else just not have the ability to even attempt to recover from their burnout?",
      "subreddit": "burnedout",
      "created_utc": 1728660047
    },
    {
      "title": "Have to go back to work soon but i’m still completely burned out. Advice? ",
      "body": "Hey everyone. About 3 weeks ago I developed an aura migraine that took me to the ER. I’ve mostly beat that at this point but that migraine also was the final straw that lead to this complete and utter burnout i’m still feeling. It brought out this horrible anxiety/panic disorder that I…think I had for a long time but repressed? Yeah I know that’s on me. I have ADHD which doesn’t help either. Anyways, I took a short Leave of absence from my job but unfortunately i’m being forced by my dad to go back this Sunday. \n\n\n\n  Thing is, i’m NOT ready to go back at all and i’m absolutely terrified. Petrified. I’m crying while typing this because i’m so scared to go back. I’m physically and mentally very weak still and the idea of having to go back to that very physically/mentally taxing job for 8 1/2 hrs a day is unfeasible. I’ve asked to switch to an easier department and/or cut my hours back but got denied because the machines wearing flesh that run the show don’t have feelings. The obvious answer is to just quit but I can’t do that because I need the insurance and $$ of course. And i’m in no mental state to get a new job. \n\nDuring my LoA i’ve been taking it easy on myself while trying my best to heal. I completely cut caffeine, very sugary/fatty foods, and alcohol from my diet. Drinking only water, smoothies, and protein shakes. I struggle with food but I try to eat simple healthy things. I go with my mom (my hero throughout all this) and my dog and go on short walks/hikes almost every day. I made small achievements like getting my hair cut, deep cleaning parts of the house, go through and donating stuff, ect. This is all a struggle to do but i’m doing it to try to get back to some normalcy and prepare myself to go back to work. \n\nBut i’m not sure it’s helping. I’m still having random panic attacks every few hours. And one always before bed and soon as I wake up. I was given some anxiety meds in the meantime which takes the edge off for sure but i’m still barely functioning. I’m finally doing what I should have done years ago which is see a psychiatrist and neurologist but they are 1 and 5(!) months out respectively (thanks American health care system). I’ve been practicing anxiety breathing exercises ALOT but I still don’t feel like I have a good grasp on them. I’ve tried meditation but I feel like you need to have a “minds eye” for that to work and I don’t. Look up Aphantasia if you’re curious. \n\nI don’t know what else to do. I want nothing more than to give up. I want to tell my dad to shove it and let me take more time off but I can’t. What else can I do to cope with this severe panic/burnout? I’ll take any ideas at this point. Thank you for reading if you made it this far. ",
      "subreddit": "burnedout",
      "created_utc": 1727885428
    },
    {
      "title": "As I wrote this post I got more and more signs that I'm actually really burned out when I thought I'm only in the begging of it. Also a little bit about notes and diaries :)",
      "body": "~~Well, so here I am with my not-yet-so-burned-out-but-im-on-the-way thing! I guess I'm the light case for now though I'm joking just enough to make most people understand that something isn't right~~ :)\n\n*Read the end, how trustworthy is the pinned questionnaire? And there I thought I came just to vent my emotions. Started at hey-ho and ended in wow am I really got to the right* r/-dress? badum-tss😂\n\nFrom the start of 2024 I already moved places two times and as expected I changed my jobs. Now I'm tech support. I'm on the phone a lot and people... They're not so nice when the Internet doesn't work, are they?🥲\n\nTo make things worse my husband was taken to the army for a year so I'm in this s--t alone. I have relatives and friends who can help somewhat but I'm can't really ask them for help, it's an awful year for most of us: mom has stomach pain and now goes to the doctors to find out why, my best friend in hospital with kidney stones which caused serious inflammation, my grandma is old, so I just can't bother her, my other friends also have quite some stuff to figure out. I don't understand why everything is just such a mess. I can't comprehend what is going on in my life right now.\n\nI'm trying not dive into selfhatred because I know I don't deserve this s--t but such thoughts keep seeping into my mind. I binge eat, gain weight and start hating myself for it. I binge read till late, I'm tired and I binge read even more.\n\nHowever I'm here to talk about that others are the bad ones so I don't give in to those thoughts! With the sad beginning and wining a little bit...\n\n**Venting starts here**\n\nCLIENTS ARE TOTAL A-HOLES, I REALLY WANT TO HELP YOU, YOU STUBBORN PIECES OF YOU-KNOW-WHAT, SO SHUT UP FOR A MINUTE AND LEARN HOW PHYSICS WORK: \"Why my wi-fi speed is only half of my tariff plan?\" WELL, BECAUSE WE CANNOT COUNTROL AIR YOU DUMMY. No, seriously, companies pay fortunes to experts to make wifi zones. What makes you think we control anything after our internet cable if there are hundreds of you who didn't plan anything about your devices? Wifi is just unstable radio-waves and we can do very little about it. Even when I'm trying to tell people what are the possibilities to imrove this situation at least a little I get: u bad-bad piple (with screams and swears and everything you can wish for)\n\n**Veing ends there**\n\nUgh... I'm fed up with people stubbornes to not do anything on their own.\n\n**Some really bad things**\n\nAbout cats in my list. (Upd. I don't know why image with the list didn't stay in the post or it's stayed &amp; I don't see it [Screenshot of my notes which I couldn't pin to the post because It's my second post on Reddit?](https://ibb.co/BVk95W5)) I'm staying with cats. Two cats to be exact and one of them is driving me insane. Never in my life I wanted to throw an innocent animal in the wall, never have I even thought about such cruelty but this cat just, idk, I'm out of words for this. It kinda does everything like a cat but way above average intensity I guess? It's always near my legs, it's always at the door, it. always. tries. to be. as. close. as. possible. I cannot go to the toilet and not have her bang, scratch and scream at the door same goes for bedroom. I kinda... Feel threatened? Unsafe? Annoyed to the point of no return? I almost want to post this specific situation on AmItheA-hol because I definitely feel as one. It's my stepsister's cats and she was supposed to stay with me and take care of them but she left to the new place and left me with those under the promise that she will find them home or will take them with her. I'm waiting when she keeps it as promised deadline is missed for a... Month or two and I keep getting fed \"soon\"s.\n\n**Bad-bad things end there**\n\nWho else to blame in my miserable state except myself? I don't know. I guess the company who gets lots of new clients and doesn't get more workers! It's in most ways great company however now they're doing it wrong. In tech-sup office air smells like burning out from the workload. Although... It's such talked-a-lot issue that I don't even feel like discussing it. I'm just tired.\n\nOh, about the title! I tried different diary apps and other help-yourself apps but nothing makes me at ease as fast and easy as my google keep trash bin of notes. When you write it in there, it's like throwing your inner thoughts in the abyss of forgotten where no one, not even you will remember that you've been sad&amp;vulnerable. It let's you accept that you're not okay and you don't do anything about it :))) Diaries on the other hand make it seem like you doing something useful when kinda you do but not really.\n\nNotes is some kind of constatation of the fact that you are f-ed up right now constatation on the same level as shopping list. \"That's how it is: this, this and that\". No obligation or burden of keeping diary entries. Diary app designs mostly incline you to write regularly in the core of their design and in the end I feel pressured and guilty about not keeping it and that's not cool. If you have the same struggle you can try basic notes app ;) One important thing tho, write there something exept worries: the doctor someone recommended, movie lists, want-to-buy, random friends birthday etc. So it won't be sad trash bin. It has to be the ordinary one 🌝\n\n**---** \n**Short for those who don't have strength to read all this**: my life past 9 months is wrecked, no one have resource to help, people are stoopid, I want to kill a cat, work sucks and try the notes instead of diaries.\n\n**---** \nI filled the questionnaire after I wrote all this and...\n\nYour total score is: 52\n\nYour score on the subscale emotional exhaustion is: 28.\n\nYour score on the subscale depersonalisation is: 24.\n\nJust wow, I kind of get it, I can literally fall asleep at my work for the past month but oh god is it that much? Am I really? Maybe I thought that I'm okay because I'm not sad and crying but just tired? (0-0)\n\nIt all makes so much sense now, oh god",
      "subreddit": "burnedout",
      "created_utc": 1727309955
    },
    {
      "title": "anxiety caused burnout(?)",
      "body": "Has anyone else experienced that, for the most part, bad anxiety could lead to exhaustion?  \n\nMy work is stressful, but I feel that the last 1.5 years have been more difficult than normal with anxiety and insomnia, and the last 4 months I have been mentally exhausted.  Now on sick leave due to insomnia and sometimes there are good days, until the anxiety rises again like a sky rocket.\n\nI have also thought about whether I could have started to become overloaded step by step 1.5 years ago, which now shows up as insomnia and severe anxiety and depression.  I have had blood tests but nothing has been found.",
      "subreddit": "burnedout",
      "created_utc": 1727282468
    },
    {
      "title": "Ignoring fist burnout signs was a mistake",
      "body": "My biggest mistake was ignoring the first burnout signs. It was very easy to dismiss them as \"just being a little tired\" and telling myself it will pass.\n\nI overworked myself and only led me to the point when I was anxious and tired all the time. I stopped caring for my hobbies and even something like watching movies or TV shows seemed like too much effort. Then no amount of rest was enough. It didn't seem like a big deal at first but when it didn't improve for months, I started to really worry.\n\nNow, I'm trying to get better and recover. I started to prioritise my health and rest, spend more time with my friends and family and I decided to change my job. I'm still tired and stressed but hopeful.\n\nThe only good thing about burnout is that it forced me to reconsider my priorities. At least now I'm aware that no job is worth my health. But I regret that I led myself to this point and I wish I took better care of myself.",
      "subreddit": "burnedout",
      "created_utc": 1727023342
    },
    {
      "title": "People wish me dead, how do I get past it?",
      "body": "I’m using a burner account because I don’t want to show my identity. The story is that I’m in a severe burnout. I can’t get to a point where I’m happy about myself anymore. Someone told me that I should never have been born or that I should k*ll myself, so my brother can be succesful. The guy was a client of my brother. Thr client said he won’t do business with him anymore because of me. The guy is really succesful and a big name in the business I am in.\n\nOthers have told me I’m not good at anything - and they’re right. I’m 30+ and I’m way behind in life. I don’t have my own place to live, no girlfriend, no kids, no succesful business (just a small one), tons of illnesses.\n\nEven my family tells me they are fed up with me and that I am a big baby.\n\nIt often feels like the world would be a better place without me.\n\nHow do I get past this?",
      "subreddit": "burnedout",
      "created_utc": 1726853483
    },
    {
      "title": "Can burnout cause depression?",
      "body": "I’ve always felt so tired of everything ever since I was around the age 12. I never wanted to live as long as I have, I’m currently 18. I don’t want to die because I’m sad or anything like that. I’m just so tired of the life. All I want to do is sleep. It’s so hard getting up and I’ve cut off so many friends because it’s just so exhausting keeping up with everyone and everything. It makes me feel like a shitty person, I try, but it’s just so hard. College is fine, but there’s no way I’m going to be able to go to college AND work. My brother is a year older than me, a full time college student, works almost full time and has plenty of time to hangout with his friends and girlfriend. My sister is in high school and more active than me. I feel like a complete failure in life. I haven’t picked a major yet because I feel like no matter what I do it won’t make me happy. Even if I were to be happy, would it be genuine? Do I even want to be happy? I just want this life to be over with already.",
      "subreddit": "burnedout",
      "created_utc": 1726757350
    },
    {
      "title": "What to do after my vacation?",
      "body": "So I don’t know how to start because my head is a mess at this point. But let’s start with saying me (F23) and my partner (F28) do the same work in healthcare. However there have been changes at work. \n\nThere has been a fusion between hospitals. This means our unit combined with another unit in another hospital. We’ve had a new boss and at this point the workload is really high. The boss doesn’t care for us and only cares for the amount of patient we’re having.\n\nMy partner is now at home with a burnout. Because she wanted another function, but didn’t get the support from the bosses. I’m finishing up some school next to work (to become a specialized nurse). But right now I feel like it’s all getting to me. \n\nI’m on vacation and I can’t get work out of my head. In a week I need to go back and I feel anxious about it. I try to read a book, work out and enjoy my vacation. But I wake up and night feeling like I can’t breath. \n\nI can’t really talk to my partner about it. Because she gets me, but also not. I can’t explain. \n\nDoes anyone has some advice on what to do once I’m at home?\n\n\n(note: I don’t want to quit my job. But if I need to the soonest date I could quit is in march because of my specialization.)",
      "subreddit": "burnedout",
      "created_utc": 1726662201
    },
    {
      "title": "Can burnout be mistaken for depression?",
      "body": "Has anyone ever mistaken burnout for depression or can depression come with burnout aswell as social anxiety?\nI'm starting to feel like myself again slowly.\nI still don't really have interests in the things I love yet but I'm leaving the house more again and I feel ready to get back into work. So I started working again this week. It's like I feel like I can handle how I feel better now. \nI don't feel as low, just more optimistic about things.\nFor about 4months I've literally just been in my bed watching summer pass me by.\nLife didn't feel worth it, I definitely felt depressed and I was scared to step out and be around people. \nI have looked up burnout symptoms and I always wonder if that's what I've been experiencing.\nI started going downhill because I was stressed and then missed 2 nights of sleep and worked throughout the night. Once the stress was over I was super tired had fog brain, disorientated and more. After a week wasn't as tired but just was very low in energy and was flooded with negative thoughts and felt like I couldn't physically do things anymore and that I didn't want to be here. I hated myself and started having flash backs of things that happened in the past, even things that shouldnt bother me and hasnt bothered me in a while but seems to bother me when i experience this low state. I spiralled deeper and deeper and felt like i lost control of my mind.\nI experience months of this yearly and I'm trying to understand myself more to know how to prevent it and help myself.\nI am starting to improve, I am feeling alot more like myself now but still not there yet.\n ",
      "subreddit": "burnedout",
      "created_utc": 1726431800
    },
    {
      "title": "I'm tired, I don't know how to keep up anymore. ",
      "body": "I'm tired, I don't know how to keep up anymore. I try to be positive but I'm burned out of trying to be happy all the time and  express that I'm okay. I find myself better  at times but it always comes back that feeling of exhaustion of everything.  It's not just a physical exhaustion but mentally, emotionally and spiritually. I'm so exhausted that I become fearful....",
      "subreddit": "burnedout",
      "created_utc": 1726054321
    },
    {
      "title": "Reassurance that burnout leave is the right thing to do",
      "body": "Reassurance that burnout leave is the right thing to do\n\nI have suffered with anxiety since I was a child. In addition, I have chronic depression and OCD. I've been in therapy and have been taking medications for half a decade straight at this point. I have been suffering with intense work anxiety for the past two years. I have had sick leave in the past which has helped temporarily, but I fear right now I am too far gone. Everyone recommends burnout leave for a substantial amount of time, and honestly, just the thought of it calms my mind. \n\nI like my job, and I am good at it. I've progressed quickly and am in a position I never thought I would be in a million years. I would like nothing more than to just...go to work and get on with things as a normal person. Right now, I am a complete mess. I am constantly tired, irritable, have decision paralysis in every aspect of my life, over consume weed to try to take my mind off things. I have mild suicidal thoughts, my work is suffering, I have no interests and I am indifferent to everything -  I tick all the burn out boxes.\n\nMy concern is work - we are extremely understaffed at a time with several huge projects. I am responsible for all of them, and with me gone it's very likely almost all of these will come to a halt. Everyone I talk to says my work will figure things but realistically I know it's not the case. With me gone it's just two junior members of the team who definitely can't handle all the responsibility. The guilt at the thought of sick leave is insurmountable at times. I feel like an awfully lazy and terrible person, like I should just persevere and get on with things, but I know rationally I am not making this up and am in need of help. \n\nHas anyone been in a similar situation and taken the burnout leave they need? It would be great to hear some from folk who have been in a similar position.",
      "subreddit": "burnedout",
      "created_utc": 1726053972
    },
    {
      "title": "any tips on how to get out of bed in the morning/function?",
      "body": "Prefacing by saying: yes, I am trying to get professional help, but need to figure out how to function in the interim.\n\nI (33f) do a combination of freelance work and odd jobs (fill-in reception, substitute teaching, etc) and have extreme difficulty getting out of bed. Once I'm out of bed it's even harder to do anything at all. It's been particularly bad lately. I have a couple of clients I do freelance fundraising for and am not on top of my projects at all, and then I feel overwhelmed and wracked with guilt, which makes it harder to reengage and catch up. It's a pretty vicious cycle. I can show up when I'm scheduled to be somewhere, but I kind of zone out if I'm not actively engaged in face-to-face interaction with other people. I have no official diagnoses re: mental health, but I definitely think there is some kind of underlying condition here.\n\nThis also makes it difficult to make ends meet. I'm behind on my bills because I'm not working enough/making enough money because I can't get myself to do anything. Usually that carrot/stick relationship is enough to light a fire under me, but lately not even that is doing it. I've been burned out for years but don't have the financial stability or support system to take a break, so I just have to keep going. It feels like I've finally hit a point where I can't rally anymore, and that's just not an option. I'm not even meeting basic needs any more- I don't eat consistently because I can't get myself to get up in the morning and make breakfast, and during the day I can't get myself to meal prep/etc. I don't think my executive function has ever been this bad. I had a series of pretty awful events this spring/early summer punctuated by a car accident that really pushed me over the limit, I think. \n\nAgain- I am seeking professional help, I'll be okay, I just need to be more productive. I'm just having a hard time right now and would appreciate any tips on how to rev the engine back up. Sorry if this was all word salad. Thank you for reading. ",
      "subreddit": "burnedout",
      "created_utc": 1725907607
    },
    {
      "title": "feeling empty and burnt out. please help ",
      "body": "i am currently in year 12 (junior year of highschool) and i am feeling extremely burnt out and exhausted everyday. i barely do any sports/clubs anymore so i dont get why i am feeling this way, im also taking all aps/advanced classes but barely passing/failing them. everyday i wakeup to live the exact same day as i did the day before, everything just seems dull and grey, im stressed and overwhelmed by school and life everyday and it is driving me insane. I try to be productive and study but it takes so much energy for me to just get out of bed. its almost as if im a zombie or a puppet i feel like my soul is just empty. what does this mean? Even though i have friends i still just feel so alone and hopeless, when i try talking to them about it they just brush it off and it doesnt seem like a big deal to them. im scared that i am going to feel like this for a long time, i just want things to go back to normal again. please give me any advice",
      "subreddit": "burnedout",
      "created_utc": 1725872138
    },
    {
      "title": "How to regain compassion?",
      "body": "I'm autistic and quite burnt out and have been for a while. But I can't truly seem to recover. I have people around me who are somewhat dependant on me for very niche specific needs or things and its gotten to the point where I'm just feeling enraged by their presences sometimes. It isn't fair on them and I feel awful but I feel like I have no compassion or empathy left to give and I have to keep showing up for others. How does one solve this? I had therapy for a while but it didn't really help in terms of burn out. I'm starting to think seriously that I need to just be alone because anyone else needing or asking me for things just gets me so triggered now and I just can't find it in me to care about the problems of others. Seems like solitude is the only real solution to me but that feels like running away ?",
      "subreddit": "burnedout",
      "created_utc": 1725389374
    },
    {
      "title": "What's wrong with me ??? ",
      "body": "so the burnout happened weeks ago and it lasted for weeks and it was my first time .   \nlost interest in everything , inclusing basic things like eating or showering and things i used to do for fun like watching random video essays or sketching , didn't feel like talking , just felt like sleeping and staying asleep . and I used to love studying ( my whole routine revolves around it , it still does but i used to want it naturally and now i have to tell myself \" be normal , follow the routine \" to push myself to do thigns i used to naturally do abck then ) , wasn't the absoluete best at every aspect of it but i loved working for long hours with 3 to 4 breaks in between . cause i loved the satisfaction i'd get from studying everything in my to - do list before going to bed , and I knew I needed to study to pursure goals of mine and I am still very aware of them but I don't feel it anymore it's just a \" meh \" thing now . after that burn out it's like i lost all my ability to do things i was good at , my memory about specific things feels awfully blurry now and I constantly feel like i'm not living up to my own expectation and can't help but feel so worthless , like i have the potential and something is not letting me use it at all . most of the things have went back to normal ... except the fact that I just cannot physically or mentally make myself work like i used to and i need to , so please share any advices available . ",
      "subreddit": "burnedout",
      "created_utc": 1725284479
    },
    {
      "title": "I don't have any big commitment. Why am I still 24/7 overwhelmed?",
      "body": "My mental energy now is just as low as when I got the burnout, which is 3 years ago. But why am I not gettimg it back? I dont work, I dont study, I dont have any big commitments... why is every little thing too much for me? Why do I get pissed when someone asks me for help when im not even busy? Why do i not even bother looking at my todo list anymore?\n\nIve been trying to regain my energy for the recent 3 years but nithing seems to work.",
      "subreddit": "burnedout",
      "created_utc": 1724938928
    },
    {
      "title": "Will I ever get out of this vicious cycle?",
      "body": "Update: I think it's important to update these things, after lying in bed for 2 days in the torture chamber that is my head, I am actually feeling a little better today, despite my stomach being weird and having a headache from stress and my legs still being in pain. Sometimes it's just good to rest, if you can, despite it feeling counterintuitive cause you have the world on your shoulders. I hope this feeling of feeling \"okay\" will not subside.\n\nI feel like I'm stuck in hell, it's like I'm a prisoner in my own body that refuses to cooperate, there's so much I want and need to do, but my physical symptoms are holding me back.\n\n**Symptoms**\n\n1. My legs are heavy: Probably the most alarming symptom, my legs and behind my knees are in agony. I feel like if I get out of bed I will collapse.\n2. My eyes feel tired: They just feel rough, sandy. I want to close them.\n3. No motivation: I didn’t take out the recycling yesterday cause I was too unmotivated.\n4. Find it hard to get out of bed: I can’t sit up straight and work at my desk.\n5. Irritable and negative: I spazz out, short fuse, I don't want to be around people cause I suck right now.\n6. Headaches:I am someone who usually never gets headaches, but it’s like a radiating pain behind my nose, behind my eyes, and in my head.\n7. Lack of sleep:I am so overwhelmed in my day to day, it spills over to my sleep and I get nightmares.\n8. Huge appetite: I just want to eat all the time, which has resulted in some weight gain.\n9. Lack of concentration/brain fog:I forget what I’m saying, can only watch brain rot content.\n10. Feeling guilty:I feel really guilty about resting, but my body has taken over and is saying “no”, I see other people working hard and doing way more work than me and I feel like a pathetic loser.\n\n**Lifestyle Changes**\n\n1. Small business owner (x2): I quit a toxic environment corporate job and opened two small businesses, I am grateful that I am slammed on both of them. Most of my energy goes towards this if I have any.\n2. Neglectful Partner: One of the small businesses is a partnership and my partner is neglecting some major stuff, which is mostly because they are out of town, but I bear most of the weight of running it.\n3. Overwhelmed: Because of the success of my business, I feel like I have over 100 things on my list at all times.\n4. Seasonal Affectional Disorder: I find that in the summer and winter I get lazy.\n\n**Routine**\n\n10pm: Go to bed\n\n7:00am: Drink 3 cups of coffee for some sense of motivation (which is way down from before)\n\n8am: Walk my dogs\n\n9am: Try to do some work\n\n9:30am: Headache, fatigue and hunger comes on and I have to lie down\n\nRest of the day: Try to rest, try to do work, stuck in this prison in my head where I want so badly to get up and do stuff but my legs are in agony, I have a headache, I'm exhausted\n\n5pm: Walk dogs again\n\n**Bad Solutions**\n\nThe reality for me right now is that I am struggling.\n\n1. I want to drink: I know this won't help at all, but I just want to feel good, even for a minute. I lie in bed and it's torture. I haven't felt good in my own body in a few days and it's been miserable. I don't drink cause I know it will make it worse.\n2. Considering smoking weed: Just instead of drinking, and hopefully be able to escape. I hate just lying in bed, I feel pathetic, I want so badly to feel good and am considering substances to escape how I feel.\n\nAll my energy these days go the bare minimum, which is taking care of my animals and cleaning and brushing my teeth, trimming my beard, doing my laundry, etc. The bare minimum is enough to exhaust me.\n\nLooking back and reflecting, I think I got burnt out years ago. Anyway, I feel like I'm just being pathetic and asking for sympathy.",
      "subreddit": "burnedout",
      "created_utc": 1724850018
    },
    {
      "title": "Will I ever be normal again",
      "body": "Hi everyone, So this is gonna be kind of long so I apologize in advance. I used to work three jobs in NYC and I got noticed by a very rich man. I was working 100 hrs a week most weeks and this went on for a while until due to how two companies treated me I had to quit two and then the only job I had left laid me off. Before I got laid off sometimes I would cry at night and I was feeling so bad because my family didn't really check up on me or anything and they lived in another state. By the time the rich guy noticed me and gave me a job I was already so burnt out and depressed I couldn't remember what I was doing from one minute to the next and I felt a significant cognitive decline. I left that job two months after starting it due to it not being the kind of thing I wanted. Fast-forward a few months and I moved home because I was realizing I missed my good relationships with people I had back home and I didn't wanna be in the rat race in Brooklyn anymore. However, I came back and started working two jobs... Again, I still couldn't remember what I was doing one minute to the next and sometimes I was getting dizzy and brain fog. I was so stubborn with what happened in NY that I actually decided to move back only to realize I was wayyy too tired and also just didn't wanna be there, and then came home again, I also really burnt the bridge with my old employer there and hoping someday it can be rebuilt(not as an employee just as people). Anyways, not I'm only working one job for two months now and I sleep a lot and I hardly do anything outside of work like I used to. I'm also not fast at work and make lots of mistakes. I've taken multivitamins and no longer get headaches and brain fog, but it seems like I don't fully have the energy I used to and still some cognitive decline (although my memory came back). Will I ever go back to normal?",
      "subreddit": "burnedout",
      "created_utc": 1724624142
    },
    {
      "title": "Mostly venting but would love any input on my post",
      "body": "I’m mostly trying to figure out what I’m struggling with, whether it’s burn out from work or depression or something else. I plan on trying therapy soon either way. \n\nOver the summer since late May I’ve been working mostly 45 hours or more a week in a kitchen, I’ve always worked in restaurant kitchens and don’t hate it, but it’s the busiest I’ve ever worked in my life. My managers are very pessimistic and complain a lot and I’m no fan of them but I get along well with the people I work with. I have struggled with the workload though being constantly busy for about 9 hours a day, sometimes 12 or more and it messes with my sleep.\n\nThe first symptom I noticed was of course the exhaustion, pretty much all the time. I then noticed I started to not enjoy my hobbies. I stopped working out because I was so drained, I starting vaping a lot which I know doesn’t help at all and I’m starting to quit. But I go home and I don’t want to play video games, or read books, or watch anything. I started just scrolling tik tok to pass the time..\n\nMy biggest worry though is how it has affected my feelings for my relationship. I can barely find any research so far as to how burn out affects your life outside of work which is really why I’m posting here. I’m very close with my girlfriend and spend a lot of time with her. She’s just about perfect for me and supports me in just about every way she can.\n\nBut lately I kind of feel somewhat numb to loving. Like I KNOW the feeling is there but I’m just not feeling it all the way and it scares the hell out of me. It makes me question whether I’m really in love or not because I’ve never experienced mental illness while in a relationship before. \n\nThat kind of sums up my current problem. Thank you anybody for reading and any feedback is appreciated ",
      "subreddit": "burnedout",
      "created_utc": 1724214153
    },
    {
      "title": "Can’t complete a client project, lost all motivation and completely burned out. ",
      "body": "30+ years in IT and last several years in professional services as consultant. Typically clients bring difficult projects they cannot figure out themselves and we normally expect the projects to be quite challenging. It is very rare we get an easy project. \n\nThe last project I have been assigned has been a nightmare. The task is quite tough. Vendor documentation is poorly written and doesn’t have the details to describe how exactly to do the job. \n\n\nI opened a support ticket with the vendor and it’s been weeks we are working on different scenarios with no luck. I feel like this 1 project not finishing on time has destroyed my confidence and I feel down every hour of the day. Typically I will not be negatively impacted and I would take it as a challenge. But not this time. I feel like there are details that had to be in the vendor manuals but for some reason omitted or assumed that I should know them. On the other hand, it is quite frustrating to be questioned multiple times a day by my own company and client and constantly explain the situation. \n\nAnd that’s what I hate about my job when it happens. One of these days I will find an easier job and quit. It’s making me quite unhappy to not have control over the details. \n\nThis is just a vent. I have no one to speak about this. Thank you for listening. ",
      "subreddit": "burnedout",
      "created_utc": 1724186654
    },
    {
      "title": "How to tell if you're burned out or getting close?",
      "body": "My job isn't for everyone, but I\"ve grown used to it.  Maybe I've been doing it for too long, idk. I'm just so tired, all the time tired. I even stopped using drugs hoping I would find energy and a purpose....no luck.",
      "subreddit": "burnedout",
      "created_utc": 1723789392
    },
    {
      "title": "Exhausted in morning",
      "body": "Hi everybody, \n\nI've been struggling with burnout for over two years now. I've had a lot of fears which have now gone (thanks to PMT and antidepressants), and now i feel the underlying tiredness. However, it's weird that I feel it much more in the morning, and it gets better as the day progresses. Shouldn't it be the other way around? \n\nI can't really do anything before 3 PM, because it just feels like I can fall asleep again at any moment (I can't though, unfortunately). Do you experience the same and if so, how do you deal with it?",
      "subreddit": "burnedout",
      "created_utc": 1723760308
    },
    {
      "title": "Can physical/medical issues cause mental fatigue?",
      "body": "I know that mental issues can make one physically tired. But is the reverse true? Can underlying physical issues make me physically tired?\n\nMy burnout happened 3 years ago and I feel like I didnt recover at all. My energy and productivity are still at their lowest, just as bad as when the burnout happened so I think something chronic is going on.\n",
      "subreddit": "burnedout",
      "created_utc": 1722707990
    },
    {
      "title": "Venting",
      "body": "My job is in government connecting people to services and benefits. I supervise a number of staffers and have my own caseload. I have been experiencing burn out for a while now, see a therapist, and just started antidepressants two weeks ago. I'm doing ok I guess, but work just really throws me. Today is an in office day for me and it all just feels intolerable, which then translates to me being frustrated with the people contacting us for help. This all comes on the heels of having to have a big hour long talk with an employee who has been straight up not working, which you guessed it, means I end up with her work. \n\nI just feel like I don't care anymote about these people or their problems. I'm frustrated with the places that are supposed to deliver the benefits and am tired of being blamed by callers like I work at those places.\n\nMy work is closing at the end of the year and I'm looking for a new job but some days I just feel so defeated and apathetic about what I do, and that's after years of trying to find ways into other parts of the operation. I just feel so done with all of this. \n\nEnd rant.",
      "subreddit": "burnedout",
      "created_utc": 1722540440
    },
    {
      "title": "Just Burned Out",
      "body": "Just need to get this off my chest as I don't know where else to turn.\n\nI'm a single 31F, a Graphic Designer for a newspaper company who participates in a couple of community clubs and helps her parents and family a lot. And I'll be honest, the past little while, I'm tired.\n\nFor the past little while, I wake up every single day, do chores, go to work, help people, come home, help family, go to bed. The conversations I have with people are the same. Politics, US politics, hospital visits, negative stuff, estate issues, etc. Every single day.....\n\nAnd on top of that, I have people telling me how to live my life, like who I should date (and trying to guilt tripping me into dating someone), telling me the same lectures and criticisms almost every single day and helping people that don't need help and more likely able to do it on their own (like today, I was helping out at a community supper take-out, one of the guests usually walks over to get their meal and wasn't able to due to hip issues, I ended up delivering it to them but found out later on today that the person was fine and was able to walk a good distance away from their place and socializing).\n\nI'm pretty much fed up at this point, its got to the point where I'm tired of making everyone else happy and tired of helping everyone. I've been taking quick naps a lot more. I'm just to the point of being exhausted.\n\nI draw and play video games where I can relax,  socialize and not worry about the real world but that's pretty much it.\n\nIf you read till the end, thanks for reading. I do appreciate it.",
      "subreddit": "burnedout",
      "created_utc": 1721622865
    },
    {
      "title": "Headaches - a sign of burnout?",
      "body": "I’ve had regular headaches for the past four months on a weekly basis (Monday through Friday). While I like my job, the work is stressful, isolating, and lonely. I keep thinking it will be calmer, but it is lurching from one problem to solve after another. There is no end in sight.\n\nThings that used to give me joy just seem too difficult - meditation, exercise, walks. Weekends are the only times that I find joy when I can sleep for long periods of time. Is this a sign of burnout? Time to look for a new job? ",
      "subreddit": "burnedout",
      "created_utc": 1720754136
    },
    {
      "title": "I Am Burned Out and its turning into serious depression. How do you cope?",
      "body": "I was hospitalized about 2 months ago after an unfortunate incident. Being in hospital and away from my job for the few days was such a refreshing feeling. I came back to work and began catching up on what I missed...but as the days went on, I noticed I was struggling with the missed work load and started procrastinating to cope. \n\nIt reached its worst yesterday when I found myself snapping at people unnecessarily, and feeling like I could just pass out from exhaustion. This morning I had the worst runny tummy, but decided on coming to work anyway. Now I'm here and every time I look at my tasks, I feel nauseous and my tummy cramps up. \n\nI can't picture living like this for long, it's making me depressed. And because I had to take leave for the hospital stay, I feel I've exhausted my options on taking time off to recoup. I don't know guys, how do you cope?   ",
      "subreddit": "burnedout",
      "created_utc": 1720522361
    },
    {
      "title": "burnt out all I used to love so now I can’t do it anymore, what else can I do",
      "body": "I have this issue that many people struggle with but as it’s happening to me I’ve battled with denial because it’s just so difficult to accept. I’m 24 now, and when I was younger than even this young age I used to do such a good job at everything I had passion for. It’s that everything I used to be good at, loved, anything I had a passion for and did : drawing, fashion, dance, music, I literally can’t do now. Today. It’s like at one point I was amazing at fashion and putting together all these outfits for myself and others and now I literally don’t know how I ever did it. I can’t do it anymore I’ve tried. I still love it though. I just stopped doing it for maybe a month and then now can’t go back into it. I used to be so good at drawing when I was in that phase and really passionate, and I’m still passionate. About all these things in fact. But just like with the fashion, as with drawing I literally can’t do it anymore. It’s not the same, it’s like I ran out of all my power in each of my passions and now when I make effort I literally fail and have no idea how I became so bad. I don’t know if this is some adhd grow up type phenomenon, but I’m so confused, why can’t I get anything I cared about to be good again and what else is there then? Is it like this forever with any passion of mine? Maybe time is the way it is and I took too long away from it so now I mentally can’t do it as good anymore but that doesn’t make sense either ?",
      "subreddit": "burnedout",
      "created_utc": 1720487723
    },
    {
      "title": "Sleep/sleeping too much/burnout/loss of energy ",
      "body": "\nAnyone that feels TIRED all the time? \n\nSo, I (21,m) feel exhausted or sleepy all day and night, sometimes I sleep for like 2 days where I only wake up to eat or go to the bathroom and maybe stay a bit awake. Even if I m not working for some weeks I still feel burnt out, no energy. Sometimes I don t go out or I go to sleep early at parties. Is this normal? I don t really remember a time in my life when I didn t love to sleep that much. Any tips? Anyone feeling this way? Btw, I m on medication for anxiety (duloxetine) and been on diff meds since i was 14.",
      "subreddit": "burnedout",
      "created_utc": 1720366201
    },
    {
      "title": "I'm not recovering. My mind is always active and I cannot relax. What can I do to calm down my mind and truly relax?",
      "body": "I have ADHD and am always overthinking things.\n\nWhen I do something of low stimulation such as walking or reading a book or laying down, I get bored very quickly with the urge to do something more exciting such as gaming or anything on the internet.\n\nBut doing exciting things is probably the thing that makes my mind so exhausted.\n\nMy mind can be compared to a computer that has 100 programs and tabs open simultaneously.\n\nWhy is my mind always so active? Why do I think about so many different things and why do I have such strong feelings related to the things that appear in my thoughts?\n\nWhy can't I, for example, take a walk and then only think about how nice the weather is and nothing else?\n\nI don't think that burnout recovery is possible at all without calming my mind. But I don't have any idea how to calm my mind, what do I do?",
      "subreddit": "burnedout",
      "created_utc": 1720122111
    },
     {
      "title": "How early is too early for burnout?",
      "body": "I’m a Physiotherapist and I graduated 3 years ago. At first, the first 6 months were great, it was tough but rewarding. You really felt like you’d made it, you were now a contributing member of society, and whenever you mentioned you were a physiotherapist at a party, people would tell you about all their aches and pains, it wasn’t a bad life.\n\n\n\nBut then you start to realise the darker side of the health industry, the mental, physical, and emotional toll it takes on you. The long and late working hours. The bleak and stark reality that you wouldn’t realistically be able to increase your earning capacity, it will constantly be you trading your time for money, day in and day out for the next 40+ years. \n\n\n\nYour salary will go up with the consumer price index, and unless you were willing to fork out 40-80K, cut down your work hours and invest the next two years of your life completing a Masters that will just unload onto you more subjective written assignments, you weren’t really going to get a commission raise or pay rise. \n\n\n\nThere are days you’re so tired, you get home and can’t even speak to your family because you’ve used up all your mental energy being cheerful with patients. There are days when you feel like you’ve absorbed all the sadness, pain and suffering your patients experience and unload onto you. Some days, random thoughts pop into your mind, “Hang on, did I send that letter for X?”. And don’t get me started on the compensable patients. \n\n\n\nI’ve hung on now for the past few years, it feels like a painful slog. Where you feel that every day, is another step deeper into the mire. You think to yourself, how much longer can I hold on. You listen to your colleagues at lunch, and they’re all struggling, inhaling their third coffee for the day. Complaining of their own aches and pains that they’ve ignored because of work. Never taking a sick day because you feel guilty for not seeing your patients or for not being sick enough. \n\n\n\nThen, life begs the question. Where do I go from here? I’ve invested 4 years of education and 50K of university debt to get this degree. I pay annual fees just to continue to practise, done thousands of dollars worth of mandatory personal development. I’ve invested another three years to clinical work. All I know and have are my physiotherapist skills. So, what can I do to survive in this increasingly financially demanding world? I’ll have to work like a slave and even then will be unable to afford a house. The more jobs and hours I work, the more I get taxed, so what’s the point in me trying so hard when at the end of it, there’s not much left over. So I ask myself, Is this really the life I want to live for the rest of my life?\n\n",
      "subreddit": "burnedout",
      "created_utc": 1719836376
    },
    {
      "title": "Never healed from burnout and got a full time job. Advice? Leave or go back to school",
      "body": "I worked and went to school at the same time last year. I should have applied for a student grant that I was aligable for. It would have covered tuition and a new computer cost, but I thought it was a loan that I would have to pay back..so just pure stupidity. I beat myself up everyday because it changed the trajectory of my life. \n\nInstead I worked and scraped together Pennie's every semester. I got honors, but if I had that money I could've taken time off work to focus on school and received high honors and more grants. I feeel so foolish. On top of this my old job got shut down for mold and it explains the further brain fog and physical stress my body was going through. Plus we didn't get breaks and the higher ups would leave me alone on the floor. I have sunken in eyes and my face lost weight from stress. Customers at my old job said my face looked more anorexic every time he comes in. I was shattered. I did lose a lot of body fat because my old job requires a lot of lifting and walking. I feel like my identity and the peace i had in my skin  has been taken, like my face looks sad in just 1 year. \n\nI got a full time job now with an hour break, but my body is still not recovered. I got covid last year as well and I still get leg pains and chronic adrenal fatigue on top of the brain fog from the burnout and mold. I've relapsed back into getting panic attacks almost daily since March so over 3 months. The only thing I've tried to help is that I got a red light therapy device and waiting for my health insurance to kick in this month for a new psychiatrist and endocrinologist. But I feel like I need to go on leave. I feel bad because the person that referred me needs me to stay 6 months to get their money. I also, talked to a coworker who's part time for school and I feel like that is more achievable for me. 8 hours a day plus 2 commuting is not the rest my body needs at the moment. I'm so upset my old toxic job got all my energy, and now I have none left for my current one. I just sleep on the weekends and can't move.\n\nAlso, I was thinking of going to school either this years intake or next year to finish my diploma in design. I would be entitled to a 8k grant. Plus applying for a buisness grant and scholarships. ",
      "subreddit": "burnedout",
      "created_utc": 1719674105
    },
    {
      "title": "How long can full recovery last? Decades?",
      "body": "I got burnt out 2.5 years ago and finally admitted to it and quit studying 2 years ago.\n\nToday my energy, my productivity, my confidence are still extremely low compared to before the burnout. Over the last 2 years it barely improved. In the past I was able to be 24/7 productive with extremely good focus, today I can only be productive for 1 to 60 minutes depending on the day and the kind of thing I have to do.\n\nSo that is like.. 5% the productivity I once had. Its terrible and I can't function normally.\n\nAm I doing my recovery wrong or is it just gonna take much longer than 2 years? How long would it take for my energy to be 100% back to normal?",
      "subreddit": "burnedout",
      "created_utc": 1719091707
    },
    {
      "title": "Burned out writing my thesis. Should I try medications ?",
      "body": "Hello there.\n\nI feel mentally blurred at the moment.\n\nI’m in dental school for the second time (in order to validate my degree in a new country). After almost 12 years of medical studies, this is starting to take a toll on me. My mental and intellectual capacities are playing out. Every little task seems impossible, and I see absolutely blank when I look at my thesis.\n\nI have lived under a lot of pressure, especially the last 4 years, and I have so far been able to keep up with it, but now as I approach the end and I’m writing my research thesis, I seem no longer to be able to force myself to be productive.\n\nI have no energy left. \n\nI feel depleted mentally and drained emotionally. Some close friends told me I might be suffering from mental burnout, and I think they might be right. \n\nThe problem is that I need to finish my thesis as soon as possible in order to avoid financial issues that I am already struggling with. To sum it up, I’ll be in debt as well as in deeper trouble if I don’t finish it before the next term. I don't have backups to that problematic. \n\nMy question is, has anyone here seen a doctor for this kind of problem ? Or has been prescribed some kind of medication for it? I need a boost to regain my will to push forward. \n\nI only need this extra push—1 or 2 months of at least some motivation (that I obviously am not able to provide by myself at the moment)—to go forward that last mile, and I’ll be done.  Then finally, I hope to give myself some well-deserved rest and self-care. \n\nPlease, no judgements. And yes, I know in theory what I need to do to get things done, I have been doing this for a looong time, health studies are no joke 😭but I am simply incapable at the moment of making myself do those things again.\n\nI’m trying to be objective here, but the truth is... I've never been on meds for mental health issues, so naturally, I’m a bit worried. \n\nThank you all in advance for your input. ",
      "subreddit": "burnedout",
      "created_utc": 1719091227
    },
    {
      "title": "What exactly is burn out?",
      "body": "For me I start being unable to focus and I get headaches and I get overwhelmed ",
      "subreddit": "burnedout",
      "created_utc": 1718915940
    },
     {
      "title": "Think im burnt out",
      "body": "I'm getting in trouble for being rude to customers at work constantly asking them to log jobs instead of helping.  So much so about to have performance management done and a change of role away from customers.\n\nSince this has occurred this week I am at severe level anxiety, constant dry retching, cryimg and can't function, struggling to eat and drink. \n\nSeem to be loosing all interest into things\n\nDid a test online which indicates severe burnout. \n\nI have 90 Long service leave days, 119 sick days, and 30 rec leave days. \n\nNot sure what to do as I'm feeling horrible.\n\n",
      "subreddit": "burnedout",
      "created_utc": 1718409594
    },
    {
      "title": "Im burned out, what do I do?",
      "body": "When does burnout hit the breaking point when its not just an excuse for not doing school work? And how do I explain to my teachers and other people that Im not just lazy without having a doctors certificate for burnout, cuz he simply doesn't believe me! \n\nSo Im 18yrs - 3rd year of art gymnasium in Europe (a difficult programm - like highschool), and have been burnout since I started. Ive realized that last year but noone would believe me - neither my parents, teacher or friends. No matter what I said they just brushed it off and simply said I was just being lazy - and that I should start putting in some effort. Somehow I manged to successfully finish the 2nd year anyway, but my burnout didn't go away in summer break - which here lasts abt two months. It didnt get better no matter how much I slept and no matter what I ate. And in 3rd year it got progressivly worse every two months. In december I started failing all of my exams (even tho I used to be a good student for whole middle and elementary schol) and no matter what I did I couldnt pass. I simply couldnt remember things, and my brainfog never went away aswell as dizziness and sleep problems - I couldn't wake up at all. But somehow through many unslept nights and way too many energy drinks I slowly fixed all of the exams I failed. I survived the rest of the school year studying for average of 10 hours a day and up to 6 cans of energy drinks a night. I still failed and fixed many exams, cuz there was just no other way to do it. Apart from that I struggled with other issues like UTIs and bladder problems, another of my two front teeth died which brought a lot of pain, a really bad caugh that lasted for a month and a half and a cold that didnt want to go away. Aswell I probably had broken my ribs on several spots and theyve been hurting for four months now but my doctor wont do anything. So due to all that I never had a chance to get better and due to not ever being able to miss a day or two of school due to being week and constant pain which I had no certificate for. And now Im here  and Im probably failing a year because my doctor said it just puberty and that its normal while talking to me like I was a ten yearold. I aswell cant do anything anymore -its gotten so bad that I barely sit, stand or walk for a longer period without getting extremly week and tired no matter how much I sleep. That made my learning process difficult - aswell as letters moving when I read (more than they used to, and no its not dysexia). How do I explain all of this to the teachers and other ppl who have no interest in understanding without  me having a certificate?",
      "subreddit": "burnedout",
      "created_utc": 1718065452
    },
    {
      "title": "Have I reached my limits?",
      "body": "The last ten years have been just exhaustion and chaos. Between, the military, deployed, working full time and getting a bachelor's and masters degree in the first five years was rough. Then my wife and I finally got situated in our dream home, both working, and living comfortable. Then she got pregnant, which should have been magical time. Then when she was 4 months pregnant, she lost her job and everything just spiraled. \n\nFirst she could not find another job at 4 months, so we burned through what little savings and racked up a lot of credit card debt because we had to make up for her income, so we hoped to keep the house. We ended up losing the house anyways right before my child was born. Luckily, I got offered a job that took us across the state, but paid more then ehqta we were making together.\n\nI have been at this job for almost two years, and I hate it so much. Its just a very toxic place and I have ended up with anxiety, depression and I have episodes of panic attacks. Yet, it pays way too much especailly in this economy. I was literally about to enter my dream field before this, but the pay was significantly lower.\n\nMy wife pretty much just decided she was not going to go back to work and just stay at home with our child. I agreed to this. We could only afford a \"fixer upper\" because the interest rates have skyrocketed. Outer last house was a 2% and now we have a 6.5%. So now, I end up working on a house all weekend trying to make it nicer because it does need the work. \n\nLast year, I startted learning a gaming engine (Unity) because game developement is my dream job. I wanted to make my own small indie games for a hobby. I had made a pretty cool little game that took me months, but ny pc died and my cloud backup was corrupted for I lost it all. It was probably a good 40-60 hours of work gone. This is work I did AFTER everyone went to bed, so I was staying up till 1 or 2 am on work nights completing this stuff.\n\nNow, I am just burned out. I don't want to watch TV, relax, talk to friends, go to work (still hate it anyways), do DIY house projects, work on game dev, play games, workout, and I can barely talk myself into playing with my son. This has all happened in a 3 year window.\n\nSorry for the long post. Any advice?",
      "subreddit": "burnedout",
      "created_utc": 1717630383
    },
    {
      "title": "How do I know I'm exhausted enough to take sick leave?",
      "body": "I struggle with the idea that when am I exhausted enough that I am \"entitled\" to apply for sick leave?\n\nI feel that my work is not so mentally taxing, even though it has elements that cause mental burden. However, a year ago I got bad news which has affected me and my loved ones. Especially makes my anxiety a lot worse.\n\nI have read about the symptoms of burnout and exhaustion and they seem to fit my situation.  Especially insomnia because sometimes I sleep well and sometimes I only sleep a few hours a night.\n\nI still go to work but I can't get anything else done.  but I am able to work.\n\nPs. I used google translate to these beacuse I was too tired to write this in english. I hope you will understand it.",
      "subreddit": "burnedout",
      "created_utc": 1715914538
    },
    {
      "title": "Is moving during a burnout a good idea",
      "body": "Short backstory: I’m 30. My country has been in a housing crisis for a long time, so I still live with my parents. I got offered a rental house.\n\nI have been diagnosed with a burnout. It’s to such an extent where I can’t do anything else than crying and sleeping. I try to work, but it is a just a shill of what I used to do. I’m seeing a psychologist who says this is normal during a burnout.\n\nI went looking for furniture and so today. And then everything became way too overwhelming for me. A voice in my head is asking if all of this is the right time. Can I plan moving out while having a burnout? How can I do everything needed, if I have so little energy and I can’t focus on anything?\n\nWhat would you do, in my position?",
      "subreddit": "burnedout",
      "created_utc": 1714862697
    },
    {
      "title": "How do you know it's time for a career break?",
      "body": "Hi everyone,\n\nI (F25) just got diagnosed with burnout and depression last week and start taking Ativan &amp; Cipralex.\n\nI graduated university in September 2022 and started a job as a finance staff in a toxic company. I worked for up to 70 hours a week. Even when I manage to stream line my work and save time, I was still expected to work overtime because my general manager is not going home yet. Both my GM and direct supervisor are men, so everyday I have to endure subjected to lewd jokes (my husband (at the time fiance) is Arab, so lots of me loving big p*nis jokes going around). It's not helping that my direct supervisor is quite touchy, he would touch me on my thigh or even pat my head. Mind you, I'm in South East Asia where sexual harassment misconduct charge will just go away, so I figure to just suck it up. I think resigning too quickly will be bad for my CV and I need to wait it out at least 1 year in that hell hole.\n\nIt eventually becomes too unbearable that I had a full mental breakdown at the office on July 2023 and I had to take sick leave for the rest of the day. By that time, I already developed GERD and the acid reflux was hurting my ears and I had tendinitis on my shoulder. That July I submit my 2 months notice, then I applied to a new job and left for that company on September 2023.\n\nMy new company has more work load but no sexual harassment going on (in fact they have strict policy on that, so that's why I choose this company). But I still irrationally freeze when interacting my boss &amp; colleague. I am also still working until late and on weekends. The physical toll is still affecting me. My GERD is under control but now I have trouble sleeping. I consistently have low energy and feel exhausted that people around me noticed. Once in a while I caught my self wanting to unsubscribe from my life. I got flu every one or two months. Last week on Monday, after a 2 week leave from national holiday &amp; recovery from HFMD, I suddenly waking up crying. My whole body hurt, I feel tired, and I don't want to go to work. If my husband did not help me to get off my bed I might just stay all day.\n\nNow that I taken my meds for almost a week, my energy level is getting better. Thoughts of unsubscribing from life is replaced with wanting to unsubsribing from work. I am thinking to follow my gut and take a career break, before my body completely break. However, my family and friend advise against it and that I should wait until September 2024 to round up my tenure here to 1 year. I just don't know if I can handle it considering I did just that last year. But now that I'm on meds will it be different? Is it possible to pull this through without a career break?\n\nDoes anyone else has similar story? How do you know it's time for a career break or to pull through?",
      "subreddit": "burnedout",
      "created_utc": 1714709496
    },
    {
      "title": "White collar life is silly but I don't see a way out",
      "body": "Where to begin.\n\nI'm in my 30s and have been really blessed to be so successful so young in my career. Some of it was hard work and sacrifice to rise quickly and have high performance while I realize some was being in the right place at the right time. I now make $300K+ a year, but I'm in such a HCOL area it leaves me comfortable but not rich enough to take extravagant vacations or own more than a modest townhome. I'm second in command of a nationally recognized firm.\n\nProblem is that I play the game of the corporate world on the outside but I'm somewhat on the spectrum and also just really practical and was raised in the country, so it's all just bullshit to me like a game we play that happens to generate a very awesome paycheck. I often wonder if anyone will ever realize our industry is not a real job. \n\nI've started feeling so jaded about the corporate world, meetings, documents, technology, everything I just don't fucking care. I want to wake up every day and go hiking, lift weights, run through a beautiful park, cook amazing meals for my kids, cruise town on my motorcycle, and read books by the campfire or in a kayak floating down the river. \n\nSeriously I spend like 75% of my day daydreaming trying to figure out how I can maintain my life and pay my mortgage while being more active and outdoors more and just enjoying the planet and not dreading staring at Teams longer. My brain feels broken and I guess maybe it's a form of burnout. My job isn't especially hard or stressful, I don't work long hours because fuck that nobody ever died wishing they'd done more than the bare minimum for soulless companies, and I just never find the solution. \n\nI'm a hard worker. I'm smart. I've got years of perfect performance reviews and promotions to show for it. And I don't give a shit about any of it, I wish I could keep my salary but trade for a job selling plants or giving river tours or something.",
      "subreddit": "burnedout",
      "created_utc": 1713924055
    },
    {
      "title": "What is going on with me?",
      "body": "Hi everyone,\n\nI've been struggling with panic attacks for about two years now, but they have always been manageable (to the point where I'd have a real shitty couple of days and then it would go away again for at least a month).\n\nI finished my bachelor's degree (teacher training) in February and started my master's degree in March. Since March, my panic attacks have been horrendous - they only last for one day, but every single week before classes start again (I only have classes on Tuesday and Thursday), so on Monday, I'd be barely able to eat because of my anxiety and I'd just sit in my room all day, waiting for Tuesday to come. It gets better once I'm at uni, but once I'm there, I ask myself \"is this really worth it?\".\n\nI just don't understand what's going on with me - I have good grades, I already have secured a spot at a wonderful school where I would be able to teach after I finish my master's degree, and I like my colleagues at uni. I'm already in therapy and my therapist told me that I seem stable and coping well with my panic attacks.\n\nSo now I'm asking myself - am I burned out? I sometimes catch myself missing the Covid lockdowns, or hoping that my lecturers get sick so that class would be cancelled or take place online. Quitting my studies and starting to work also scares me shitless, and the thought of starting to study something else breaks my heart because teaching is something that I aspired to do since I started primary school. At the moment, nothing really brings me joy anymore (apart from playing Stardew Valley) - I feel like I just do stuff to pass time.\n\nI would be grateful for any advice, encouraging comment, whatsoever. I'm just really desperate at the moment.",
      "subreddit": "burnedout",
      "created_utc": 1713351932
    },
     {
      "title": "Burnt out and lost ",
      "body": "Hello I’ve been burnt out for about three years and I still am. It started when I was going to college and got to a class I failed 3 times and I just didn’t have the motivation or energy to go back I was emotionally drained so I took a break. I tried in that time to study IT on my own and maybe get a few certifications maybe even a new job I was hopeful but after a while I realized that I kept losing interest and I’d go in a different direction maybe networking or maybe security I thought then I just stopped but I would still start up vm here or there and just stare at it not really knowing what to do with it and then delete it. Then at the beginning of this I had a major medical problem and had to be in the hospital for a week. When I got home I felt like I was going to be ok like my burn out was over. I felt good for two weeks and now I’m back to square one back to not knowing which way to go. I feel so lost and exhausted and alone and like absolutely no one cares. I have no idea how to get out of this hell ",
      "subreddit": "burnedout",
      "created_utc": 1711935992
    },
    {
      "title": "In the middle of a work burnout",
      "body": "I'm a middle manager, and part of my job is to enforce a policy that is against my core values resulting in burnout.\n\nI tried to be open about my mental state with my managers and HR and I just felt dismissed and ignored. Feeling utterly helpless I have burnout which has been progressing as days and weeks fly by.\n\nSo far I took a day off after severe headache and fatigue almost caused me to blackout. That was the signal that made me aware of my burnout. I still had some trust in the system so I tried to be open and talk about this with my managers and hr. The lack of empathy have caused me to lose trust and now I feel like I'm in someone's crosshairs since I'm now getting 'constructive feedback'. I'm skeptical of everything at work now so I think it's becoming untenable.\n\nFollowing this, I just could not find the motivation to work and everything is a chore. I notice that this is worse after I have a chat with my managers. Every interaction with them burns me out that I need a day or two to recover. I feel like I'm dying a thousand cuts.\n\nI'm still fully functioning because of two things:\n1. I'm learning to drive and I totally enjoy it. It has helped me reset my state of mind every week. I'm even surprised this activity sustained me because it has it's own stressful bits but I guess in a positive way.\n2. I'm now actively looking for another job and interviewing. This one have calmed me down because it is a way to take back control.\n\n\nTldr, if you still find joy or relief in an activity or action then that means burnout can still be managed.",
      "subreddit": "burnedout",
      "created_utc": 1711747079
    },
    {
      "title": "Stuck and hopeless",
      "body": "Hi,\n\nI’ve been feeling burned out for a long time but in December 2023 it all became too much and I had to stop working (I’ve been off work ever since). This is the second time I’m experiencing a burn out but this time it’s way more intense.\n\nThe first time around it was very linked to a toxic work situation and me simply overworking and I was ‘over it’ within 3 months. I managed to get back to a healthy gym and eating routine.\n\nThis time around it feels a lot less straight forward, it wasn’t the workload that pushed me over the edge but more personal circumstances mixed with a shitty manager. I seem to be getting worse rather than better.\n\nI’m struggling with:\n\n- fatigue and even though I sleep 8h a night I wake up early and feel like I haven’t slept\n- muscle pains and aches\n- joint and shoulder pain\n- lack of energy, I am unable to consistently go to the gym and exercise \n- digestion issues and heartburn\n- extreme brain fog and numbness\n\nI’ve gone to the doctor and had every possible test done but no results.\n\nI’m seeing a therapist and psychosomatic physiotherapist but nothing seems to help.\n\nThe only time I felt a bit more hopeful was when I went on a short holiday and my symptoms were significantly less but returned the second I came back home.\n\nI’m really frustrated because I’m trying to get better by: \n\n- going on walks\n- eating healthy\n- reducing screen time \n- seeking professional help\n- building a sleep routine\n\nBut nothing seems to be working and I don’t know how to get better.\n\nDoes anyone have advice or can relate?",
      "subreddit": "burnedout",
      "created_utc": 1709288644
    },
    {
      "title": "I feel like i'm being left behind at my workplace",
      "body": "I'd love to get some advice maybe but i'd mostly just like to know if i'm being delusional or not.\n\nI (27F) left work with a burnout late august last year. I was always one of the forerunners of my workplace, often was praised for my extra side work and innovative ideas and was told multiple times by my manager that she sees me growing towards a senior role. The company was going through rough times and there was lots of pressure on our department, this in combination with my manager being temporarily replaced with an outsider (with almost no knowledge and who did not actually function as a manager), I had to deal with a lot of things that usually are not in my scope of work and that gave me a lot of stress. Too much stress actually. I've been back at my job for a few months now, slowly increasing my working hours. \n\nToday i learned that the person who took over a part of my work responsibilities has gotten a better yearly review (sorry, not a native speaker) and most likely will soon be growing into the senior role. Although i've talked with my manager about getting my work responsibilities back, it's been left hanging in the air and i feel kind of betrayed. I've worked my ass off trying to keep going for the last half year even though i don't feel remotely as happy going to work as before. I don't think i could live with my coworker (who has been with the company for less time than me) being my superior. \n\nAm i just being too emotional? ",
      "subreddit": "burnedout",
      "created_utc": 1709124464
    },
    {
      "title": "Balancing Work, Dreams, and Burnout – Losing Motivation to Chase My Passion",
      "body": "I'm not sure if this is the right reddit for me or not.  Hope it is.\n\n\n\nI'm a full-time employee, and my job pays me well (all bills are paid, and food is on my table). I still don't have my own home (rental). And I'm not trying to complain about the workload, even though I would like to because it's too much to handle. However, I must admit I'm blessed for being employed.  \n\n\n\nI just started doing my master's (EMBA), first semester.  Assignments are kind of long but that's fine.  \n\n\n\nIn 2020, I found out that I love telling stories and making games (game development).  I even published a game on a well known website for PC games in 2021.  It didn't make me money, but I feel proud that I achieved that.\n\n\n\nI had so much hope that one day I would become a full-time game developer but with my full-time job, but lately I don't have that energy to work on anything once I'm home.  I work from 7:30 AM till 4:30 PM; very often till 6 PM.  And even when I get home I have things to do for work.  So, I cannot just leave my work back at the office, I take it home with me.\n\n\n\nNowadays, I'm always tired and down and I started questioning about my dream of being a full-time game developer.  Even my PC that I built for this purpose only, now being used for work.  I even started telling myself that eventually, we will all die, so why bother following such dreams? But I get more depressed when this part of my brain starts talking this way.\n\n\n\nI tried organizing my days but even when with that I ended up going home so tired after fighting at work and fell asleep on the coach.  \n\n\n\nIt's not that I don't have the time, it's that I don't have the energy to do anything.  I'm not even working out like I used to and it took it's toll on my weight.  I cannot lose weight not matter what.\n\n\n\nI was diagnosed with an emotionally unstable personality, borderline type.  But I'm unsure if this has something to do with my current emotional situation.\n\n\n\nEven while typing this reddit post, I feel overwhelmed because I've never been able to talk my head out.  \n\n\n\nThanks for reading.\n\n",
      "subreddit": "findapath",
      "created_utc": 1729134111
    },
    {
      "title": "What career/jobs are there for me, a chemistry graduate that don’t require further study?",
      "body": "Hi all I hope you’re well!\n\nI have a bachelors in chemistry and have worked in IT however I have grown tired of having to constantly study and keep up to date with my skills after work. After doing my degree I guess I just got burned out with studying as it was very difficult and mentally draining. I’m looking for a change into a career that can give me a decent salary a month where I wouldn’t need to be studying for certifications or sitting exams \n\nIf that’s possible? \n\nI’m in the UK\n\nMany thanks!",
      "subreddit": "findapath",
      "created_utc": 1729131470
    },
    {
      "title": "I'm studying primary teaching, but I really don't know if it's for me. I can't keep waiting for the lightbulb moment",
      "body": "I wish I was set on what I want to do, but I never have been. There's so much that's crossed my mind. I also wanted to study psychology, but i ended up going with primary teaching. However, I struggled more than I ever would imagine while at the schools and 30 kids being there overwhelmed me too much. I am best in one to one or even small groups. I just get too burnt out in social interactions.\nHowever, I want to help those disadvantaged children, those who have nobody to turn to and just want someone there to support them. I would love to make a difference, but now, time is ticking away and at 21, I still have no clue on the career I would like to pursue. My mind just feels scrambled most of the time.",
      "subreddit": "findapath",
      "created_utc": 1729100607
    },
    {
      "title": "Mid 20s burned out to the max",
      "body": "I finished with the STEM degree and burning hard now. I’m done with coding, I don’t want to code anything, it’s so stressful, I don’t have any motivation to be technical.\n\nI want a job with talking but also will be technical. I’m tired of living paycheck to paycheck. Doesn’t help that my mom terrorizes me with my grandparents being sick. Blaming me guilty for not caring enough. I’m living on the other coast I have tried to call my relatives but no one responded, my uncle told me my grandma was in the hospital and not to call her because she’s weak. My mom started saying that my uncle is appalled by my audacious behavior. However that doesn’t make sense, why wouldn’t a grown man told me if something is wrong.\n\nAnyway, I’m not sure how to feel about it. As much as I want to care about my grandparents I cannot let my life be on pause. With them having health issues the entire day/several days becomes miserable and unlivable. I cannot be normal knowing that someone close to me is suffering. \n\nI want at the end of the day to find a good and engaging career where I’ll have no stress, be a valuable worker and not worry living in constant misery. Sorry needed to talk it out.",
      "subreddit": "findapath",
      "created_utc": 1729100129
    },
    {
      "title": "Accepting a counter-offer ? [N/A]",
      "body": "\nI posted earlier about being stuck between two job offers, both with a 50% pay increase. Now, things have taken an unexpected turn, and I could use your advice.\n\nFor some context, I’ve been the only HR professional at a brick factory for the past three years. When I joined, the company was just starting, and I took care of everything—recruitment, payroll, compliance, safety, employee relations. It was a great learning experience, but as the company grew, the workload became overwhelming. Despite all my efforts and postive feedback, I didn’t get any raise over the past three years, and I’ve been feeling burnt out and underappreciated.\n\nThe company is also expecting to launch a new production site in the same factory by the end of the year.\n\nI applied elsewhere, and things went well. I now have two offers with a 50% increase in pay. One is for an HRBP role at a multinational, focusing on fieldwork and union relations, and the other is for an HR Manager role at a local company, where I’d manage three assistants and take on more strategic responsibilities. Both roles have their pros and cons, and I’ve been trying to decide between them.\n\nBut then, the CEO called me in for a meeting. To my surprise, he was very positive and eager to keep me. He told me to take a week off and said that once I returned to headquarters, we’d sit down and discuss a new offer. He made it clear that his counteroffer would exceed anything I’ve received from the other companies. I told him directly that if I were to stay, I’d need a promotion and a significant raise, and he seemed confident that we could make that happen.\n\nNow I’m conflicted. I feel like I finally have the leverage I’ve been missing all this time, but I also worry that even with a promotion or a raise, things could go back to the way they were—too much work and not enough support. On top of that, I know my profile is in demand. I have a pretty good success rate when applying elsewhere, so I don’t feel stuck.\n\nShould I take this chance to negotiate a great deal with my current company, or would it be smarter to move on and take one of the two offers I already have? Part of me feels like staying would mean building on what I’ve already accomplished, but I’m also afraid of repeating the same burnout.\n\nI’d really appreciate any advice or insights from people who’ve been in a similar situation. Thanks for reading.",
      "subreddit": "humanresources",
      "created_utc": 1728840103
    },
    {
      "title": "I have a bachelors degree and I’m thinking about being a cake decorator. Am I crazy? ",
      "body": "25 F here. I feel stuck. I have a bachelors in psych. I graduated in 2021 and I’ve been working with people with disabilities in various different jobs since then. I’ve never had a job for more than a year. I’m very intelligent, did well in school, but have mental health issues and I burn out of jobs hard and fast. I’m very disorganized and an emotional wreck at times. I’m tired of working in human services. I have a CNA license, but I don’t want to be a CNA. I was thinking about being a research assistant, but those jobs are scarce. \n\nI was looking at jobs and Sam’s Club is hiring for a cake decorator for $19-$26 an hour. That’s insane to me, cause that’s the same as the shitty entry level bachelors degree jobs I’m looking at with like half the stress. Decorating cakes all day literally sounds like a dream come true. Should I just go for it? Would that be a horrible idea? I mean, it would be like a pretty much got a degree for nothing. But my bachelors is literally giving me nothing right now. I just don’t know. \n\nEdit: Thanks everyone. Everyone is a lot more encouraging than I anticipated. I guess it’s not such a crazy idea after all! ",
      "subreddit": "careerguidance",
      "created_utc": 1729210302
    },
    {
      "title": "Any of the things normal in a workplace? ",
      "body": "Unhappy. Unfulfilled. Toxic environment. Low pay. Burnt out. \n\n\nI’m sure some/all of you can relate. Share your story - geographical region, approx age, approx wage, profession, what you are struggling with, etc. \n\n\nI’m 30(F), living in Canada, working as a paralegal - 10 years in the legal field in total (was a legal assistant and then became a paralegal in 2023) I am making 77K\n\nThings I despise about my profession/or mostly my firm, or the people I work with:\n\n(Are any of the things below NORMAL? Honestly HATE how some firms operate, but I also know same shit diff pile for every work place so it boils down to what you can accept and can’t lol)\n\n-texts before my starting time of 9am and after working hours (I know right? I will formally make a complaint after I find another job)\n\n-texts advising that I need to call them once I am at work (especially when I am working from home) which is at 9am - over very insignificant matters that could be an email\n\n-inefficient/inexperienced lawyers: always wanting/needing everything on a rush when it’s not necessary, inexperienced lawyers with unnecessary anxiety - putting you on edge every other day.\n\n-just the other day, I was working from home, I had 22 phone calls with one of my lawyer in preparing court documents back and forth and between 5 people, but is it really necessary?\n\n-constantly being pulled in 50 different directions\n\n-firm is whack, needing people to work with other and additional lawyers cause we are understaffed. I am currently working with two lawyers, and one additional lawyer on one file. \n\n-most people did not get a raise this year \n\n-colleagues are generally toxic in the workplace, love to gossip and stir drama (will also be making a formal complaint on a certain individual that continues to stir drama around the office and tries to get me involved when I clearly DO NOT. Good thing is she pretends I am invisible now (: )\n\n-Management are complete snakes, constantly making false promises to new employees that joins the firm, is extremely cheap, manipulates people by not being truthful, and never fulfilling people’s needs or wants\n\n-Snarky and inexperienced staffs acting like they know what is going on better than you do but they’re just a bunch of weirdos wearing the lawyer hat to perform tricks. If I could say this: you’re not even a decent lawyer  or know what you are doing for the most part. Sit your ass down before someone hands your inexperienced ass to you before a judge.\n\n-most people work remote, and people who are 100% from other locations love to email people in our location to prepare documents for them in person. I always get tasked from those people, am sick and tired of their sloppy work that I need to clean up - while they let me know the morning of the deadline, they log off at 12pm, ditch the ball to me to revise and finalize their sloppy work and for me to have things filed. I have raised this with my lawyer that I cannot operate like this. Last time, I was tasked at 10:40am and then the deadline was at 12pm. To revise, finalize and file sets of application and affidavit materials working from home. LMAO. \n\nMore things I hate coming soon…..as I need to get back to slavery. ",
      "subreddit": "careerguidance",
      "created_utc": 1729204324
    },
    {
      "title": "Quit job 2 weeks in",
      "body": "I aced multiple rounds of interview for an office job among 150 applicants but ended up quitting on it in my second week. It's a combination of knowing that I'm not a good fit, I can't handle change without spiraling into paralyzing anxiety and just overall burnout from being a working mom. The job itself involved managing multiple stakeholders from different cultures, and I just could not get through the day without crumbling from stress. It was a huge step outside of my comfort zone, and before joining I didn't have the space to do some internal work to prepare myself mentally and physically (i.e. no rest from previous jobs, full time and one part time that weren't any less anxiety-inducing)\nI feel so so embarrassed quitting after my bosses had taken me out for introductory lunches, and overall being so welcoming. I just don't want to do my notice period anymore from the shame and am tempted to just disappear on everyone, just like I have many times in my life.\n\nI'm trying to be kind to myself, but I know this time there's no excuse for this loser attitude. Will I regret ghosting everybody or should i just move on. ",
      "subreddit": "careeradvice",
      "created_utc": 1729150660
    },
    {
      "title": "Career Shift ? ",
      "body": "I got my undergrad in middle childhood education. I have been teaching for 3 years and while I love it half the time the other half of the time I dream about leaving the profession. I cannot see myself being an educator for the next 30 years. However, I cannot see myself really doing anything else. I do have this fantasy of an idea to open a bookstore/cafe and bar but this is something that I’m not sure is even realistic as I have just over $20,000 in student loans. So this is what I am good at and I have an education degree I’m not sure where else I can apply that’s not education. I have been thinking about getting my masters, but I am not even sure in what. I just want it as a way to escape education. I am good at my job but I’m burnt out after 3 years. How long can I sustain this? Looking for advice from anyone who has undergone a career shift and how you found what you can see yourself doing for 30+ years. ",
      "subreddit": "Careers",
      "created_utc": 1729128584
    },
    {
      "title": "Seeking another job, today was a last straw - advice",
      "body": "I've posted on and off about my current position. How my facility is going South, my job is stressing me out, overworked, underpaid, and after today can add gaslit and toxic workplace to the list.\n\nIMPORTANT edit, type of job  - If it makes any difference, I'm medical, a vast amount of education, certifications and experience. Part of why my body hurts us because I'm clinical - I lift, change, pick up, feed, move, assist, care for patients all day every day. \nI'm applying for more administrative medical jobs or as triage vs full on floor patient caregiving.\nI'm already getting so many job interview offers for better pay, less stress and physical toll, etc.\n\n\nI'm thoroughly burnt out after today. My body hurts. My soul hurts. \n\nI have two, technically three interviews lined up. One tomorrow morning. \n\n\nAbsolutely no part of me wants to go in tomorrow. Especially if the interview goes well. Problem is, I'm very low income responsible for a house of 7 with only my sister and I working full time.\n\n\nI'm not sure we could afford the hit of me dropping the job before I secure another one but.....truly the idea of clocking in tomorrow is killing me. I'm excited for the three opportunities I have scheduled. But I need the income.\n\n\nIn what cases is it justifiable to drop a job before you have another secure one lined up? \n\nETA - I've always lucked out in finding jobs easily with my vast career experience and education.\nI know it's brutal out there right now though.",
      "subreddit": "Careers",
      "created_utc": 1728613983
    },
    {
      "title": "Moving from Recruiting to Executive Assisting",
      "body": "I’m pretty much completely burnt out. Insane hiring goals, little to no support, and low pay at this most recent company. \n\nI’m a Senior Recruiter with 8 years of GTM recruiting experience at startups and am currently handling full cycle— recruiting, sourcing, and coordination. At this company, I own every piece of the recruiting process. \n\nMy goal last month was to hire 12 AEs all across the country. We have a fairly specific hiring profile. I hit 8. This month my goal is 18. I’M. BURNING. OUT. \n\nHas anyone tried to make a switch from recruiting to an Executive Assistant role? I think my skills would transfer nicely. And I’m already (sadly) very consistently checking Slack and email all the time while I’m awake. ",
      "subreddit": "recruiting",
      "created_utc": 1728951104
    }
]
  
  